{
    "data":[
        {
            "id":1,
            "paraphrase":[
                "What is the name of the scuplture that was created most recently?"
            ],
            "question":" What is the title of the sculpture that was created in the most recent year?",
            "sql":[
                "SELECT title ,  YEAR FROM sculptures ORDER BY YEAR DESC LIMIT 1"
            ]
        },
        {
            "id":2,
            "paraphrase":[
                "What is the name of the oldest painting and where is it located?"
            ],
            "question":" What is the title and location of the oldest painting?",
            "sql":[
                "SELECT title ,  LOCATION ,  YEAR FROM paintings ORDER BY YEAR LIMIT 1"
            ]
        },
        {
            "id":3,
            "paraphrase":[
                "What are the names of all sculptures in gallery 226?"
            ],
            "question":" Find the names of all sculptures located in gallery 226.",
            "sql":[
                "SELECT title FROM sculptures WHERE LOCATION  =  \"Gallery 226\""
            ]
        },
        {
            "id":4,
            "paraphrase":[
                "What are the paintings called and where are they located?"
            ],
            "question":" List the title and location of all paintings.",
            "sql":[
                "SELECT title ,  LOCATION FROM paintings"
            ]
        },
        {
            "id":5,
            "paraphrase":[
                "What are the sculptures called and where are they located?"
            ],
            "question":" List the title and location of all sculptures.",
            "sql":[
                "SELECT title ,  LOCATION FROM sculptures"
            ]
        },
        {
            "id":6,
            "paraphrase":[
                "What mediums were used for the paining with id = 80?"
            ],
            "question":" What are the medium types of the painting with id = 80",
            "sql":[
                "SELECT medium FROM paintings WHERE paintingID  =  80"
            ]
        },
        {
            "id":7,
            "paraphrase":[
                "What are the full names of artists born after 1850?"
            ],
            "question":" Find the first and last names of all artists who were born after 1850.",
            "sql":[
                "SELECT lname ,  fname FROM artists WHERE birthYear  >  1850"
            ]
        },
        {
            "id":8,
            "paraphrase":[
                "What are the names and dates created for all sculptures not located in gallery 226?"
            ],
            "question":" Find the names and years of all sculptures that are not located in gallery 226.",
            "sql":[
                "SELECT title ,  YEAR FROM sculptures WHERE LOCATION ! =  \"Gallery 226\""
            ]
        },
        {
            "id":9,
            "paraphrase":[
                "What is the first and last name of each distinct artists who made a sculpture before 1900?"
            ],
            "question":" What are the first and last names of all distinct artists who made sculptures before 1900?",
            "sql":[
                "SELECT DISTINCT T1.lname ,  T1.fname FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID WHERE T2.year  <  1900"
            ]
        },
        {
            "id":10,
            "paraphrase":[
                "What is the birth year of each distinct artists who created sculptures after 1920?"
            ],
            "question":" Find the birth years of all distinct artists who made sculptures after 1920?",
            "sql":[
                "SELECT DISTINCT T1.birthYear FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID WHERE T2.year  >  1920"
            ]
        },
        {
            "id":11,
            "paraphrase":[
                "Give the full name of the artist who lived the longest."
            ],
            "question":" What are the first and last names of the artist who lived the longest?",
            "sql":[
                "SELECT lname ,  fname FROM artists ORDER BY deathYear - birthYear DESC LIMIT 1"
            ]
        },
        {
            "id":12,
            "paraphrase":[
                "How old is the artist who lived the shortest life?"
            ],
            "question":" What is the age of the artist who had the shortest life?",
            "sql":[
                "SELECT deathYear - birthYear FROM artists ORDER BY deathYear - birthYear LIMIT 1"
            ]
        },
        {
            "id":13,
            "paraphrase":[
                "What is the first name and age of the artist who lived the longest?"
            ],
            "question":" What are the first name and age of the artist who had the longest life?",
            "sql":[
                "SELECT fname  ,  deathYear - birthYear FROM artists ORDER BY deathYear - birthYear DESC LIMIT 1"
            ]
        },
        {
            "id":14,
            "paraphrase":[
                "What is the total number of paintings exhibited in gallery 240?"
            ],
            "question":" How many paintings are exhibited at gallery 240?",
            "sql":[
                "SELECT count(*) FROM paintings WHERE LOCATION  =  \"Gallery 240\""
            ]
        },
        {
            "id":15,
            "paraphrase":[
                "What is the painting count of the artist with the longest life?"
            ],
            "question":" How many paintings did the artist with the longest life make?",
            "sql":[
                "SELECT count(*) ,  T2.painterID FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID GROUP BY T2.painterID ORDER BY T1.deathYear - T1.birthYear DESC LIMIT 1"
            ]
        },
        {
            "id":16,
            "paraphrase":[
                "What is the name and year of each painting created by the artist whose first name is Mary?"
            ],
            "question":" Give me a list of names and years of paintings that were created by the artist whose first name is Mary.",
            "sql":[
                "SELECT T2.title ,   T2.year FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T1.fname  =  \"Mary\""
            ]
        },
        {
            "id":17,
            "paraphrase":[
                "How wide were the paintings by the artist who was born prior to 1850?"
            ],
            "question":" What are the widths of the paintings that were created by the artist who was born before 1850?",
            "sql":[
                "SELECT T2.width_mm FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T1.birthYear  <  1850"
            ]
        },
        {
            "id":18,
            "paraphrase":[
                "In what locations and on what mediums are the paintings created by the artist with the first name Pablo?"
            ],
            "question":" What are the location and medium type of paintings that are created by the artist whose first name is Pablo?",
            "sql":[
                "SELECT T2.location ,   T2.medium FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T1.fname  =  \"Pablo\""
            ]
        },
        {
            "id":19,
            "paraphrase":[
                "Give the full names of artists who have created paintings and sculptures."
            ],
            "question":" Find the first and last names of the artists who have both works of paintings and sculptures?",
            "sql":[
                "SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID INTERSECT SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID"
            ]
        },
        {
            "id":20,
            "paraphrase":[
                "What are the first and last names of artists who have painted using both oil and lithographic mediums?"
            ],
            "question":" What are the first and last names of the artists who have not only medium oil paintings but also paintings with the lithographic medium?",
            "sql":[
                "SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T2.medium  =  \"oil\" INTERSECT SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T2.medium  =  \"lithograph\""
            ]
        },
        {
            "id":21,
            "paraphrase":[
                "In what year was the artist who created a painting in 1884 born?"
            ],
            "question":" What is the birth year of the artist who created a painting in 1884 that is on canvas?",
            "sql":[
                "SELECT T1.birthYear FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T2.year  =  1884 AND mediumOn  =  \"canvas\""
            ]
        },
        {
            "id":22,
            "paraphrase":[
                "What are first names of the artists with oil paintings in gallery 241?"
            ],
            "question":" What are the unique first names of the artists who had medium oil paintings located in gallery 241?",
            "sql":[
                "SELECT DISTINCT T1.fname FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T2.medium  =  \"oil\" AND LOCATION  =  \"Gallery 241\""
            ]
        },
        {
            "id":23,
            "paraphrase":[
                "How many works are there in each medium?"
            ],
            "question":" What are the numbers of works for different medium type?",
            "sql":[
                "SELECT count(*) ,  medium FROM paintings GROUP BY medium"
            ]
        },
        {
            "id":24,
            "paraphrase":[
                "What is the average height of paintings for different medium types?"
            ],
            "question":" What are the average height of paintings for different medium types?",
            "sql":[
                "SELECT avg(height_mm) ,  medium FROM paintings GROUP BY medium"
            ]
        },
        {
            "id":25,
            "paraphrase":[
                "How many paintings were created before 1900 in different locations?"
            ],
            "question":" What are the numbers of paintings created before 1900 in different places?",
            "sql":[
                "SELECT count(*) ,  LOCATION FROM paintings WHERE YEAR  <  1900 GROUP BY LOCATION"
            ]
        },
        {
            "id":26,
            "paraphrase":[
                "Give the names of all oil paintings created after 1910."
            ],
            "question":" What are the titles of paintings that are created after 1910 and whose medium is oil?",
            "sql":[
                "SELECT title FROM paintings WHERE YEAR  >  1910 AND medium  =  \"oil\""
            ]
        },
        {
            "id":27,
            "paraphrase":[
                "What is the unique id of every painter who had a medium oil painting displayed at gallery 240?"
            ],
            "question":" Find the unique id of the painters who had medium oil paintings exhibited at gallery 240?",
            "sql":[
                "SELECT DISTINCT painterID FROM paintings WHERE medium  =  \"oil\" AND LOCATION  =  \"Gallery 240\""
            ]
        },
        {
            "id":28,
            "paraphrase":[
                "What are the distinct titles of every painting that has a greater height than some painting on canvas?"
            ],
            "question":" Find the distinct titles of all the paintings that have a longer height than some painting on canvas?",
            "sql":[
                "SELECT DISTINCT title FROM paintings WHERE height_mm  >  (SELECT min(height_mm) FROM paintings WHERE mediumOn  =  \"canvas\")"
            ]
        },
        {
            "id":29,
            "paraphrase":[
                "What are the distinct ids of every painting that is older than some painting in gallery 240?"
            ],
            "question":" Find the distinct ids of all paintings that are older than some painting at location gallery 240.",
            "sql":[
                "SELECT paintingID FROM paintings WHERE YEAR  <  (SELECT max(YEAR) FROM paintings WHERE LOCATION  =  \"Gallery 240\")"
            ]
        },
        {
            "id":30,
            "paraphrase":[
                "What is the id of the oldest painting?"
            ],
            "question":" Find the id of the oldest painting.",
            "sql":[
                "SELECT paintingID FROM paintings ORDER BY YEAR LIMIT 1"
            ]
        },
        {
            "id":31,
            "paraphrase":[
                "What is the full name of the artist with a sculpture whose title includes the word \"female\"?"
            ],
            "question":" What are the first and last name of the artist who had a sculpture work whose title has the word “female” in it?",
            "sql":[
                "SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID WHERE T2.title LIKE \"%female%\""
            ]
        },
        {
            "id":32,
            "paraphrase":[
                "What is the name of every distinct painting in alphabetical order?"
            ],
            "question":" List the names of all distinct paintings in alphabetical order.",
            "sql":[
                "SELECT DISTINCT title FROM paintings ORDER BY title"
            ]
        },
        {
            "id":33,
            "paraphrase":[
                "List the names of all distinct paintings from shortest to longest in height."
            ],
            "question":" List the names of all distinct paintings ordered by length.",
            "sql":[
                "SELECT DISTINCT title FROM paintings ORDER BY height_mm"
            ]
        },
        {
            "id":34,
            "paraphrase":[
                "What are the names of  paintings and scupltures created between 1900 and 1950?"
            ],
            "question":" What are the names of both paintings and sculptures created between 1900 and 1950?",
            "sql":[
                "SELECT title FROM paintings WHERE YEAR BETWEEN 1900 AND 1950 UNION SELECT title FROM sculptures WHERE YEAR BETWEEN 1900 AND 1950"
            ]
        },
        {
            "id":35,
            "paraphrase":[
                "What are the titles of all paintings and sculpture works made by the artist whose id is 222?"
            ],
            "question":" Find the titles of paintings and sculpture works made by the artist whose id is 222?",
            "sql":[
                "SELECT T2.title FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T1.artistID  =  222 UNION SELECT T2.title FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID WHERE T1.artistID  =  222"
            ]
        },
        {
            "id":36,
            "paraphrase":[
                "What is the id of the artist with the most paintings before 1900?"
            ],
            "question":" What is the id of the artist who has the highest number of painting works before 1900?",
            "sql":[
                "SELECT T1.artistID FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T2.year  <  1900 GROUP BY T1.artistID ORDER BY count(*) DESC LIMIT 1"
            ]
        },
        {
            "id":37,
            "paraphrase":[
                "What is the first name of the sculptor with the greatest number of works?"
            ],
            "question":" What is the first name of the artist who has the highest number of sculptures?",
            "sql":[
                "SELECT T1.fname FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID GROUP BY T2.sculptorID ORDER BY count(*) DESC LIMIT 1"
            ]
        },
        {
            "id":38,
            "paraphrase":[
                "What are the titles of paintings that have a width less than 600 or a height taller taller than 800?"
            ],
            "question":" What are the names of paintings whose width is less than 600 or height is larger than 800?",
            "sql":[
                "SELECT title FROM paintings WHERE width_mm  <  600 OR height_mm  >  800"
            ]
        },
        {
            "id":39,
            "paraphrase":[
                "What locations have works painted before 1885 or after 1930?"
            ],
            "question":" Which locations have paintings created before 1885 or after 1930?",
            "sql":[
                "SELECT DISTINCT LOCATION FROM paintings WHERE YEAR  < 1885 OR YEAR  >  1930"
            ]
        },
        {
            "id":40,
            "paraphrase":[
                "What are the ids of paintings that are taller than 500 and shorter than 2000?"
            ],
            "question":" Find the ids of paintings whose height is bigger than 500 and less than 2000?",
            "sql":[
                "SELECT paintingID FROM paintings WHERE height_mm  >  500 AND height_mm  <  2000"
            ]
        },
        {
            "id":41,
            "paraphrase":[
                "What are the locations that have paintings in the mediums of on panels and on canvas?"
            ],
            "question":" Which locations have paintings in the mediums of on panel and on canvas?",
            "sql":[
                "SELECT DISTINCT LOCATION FROM paintings WHERE mediumOn  =  \"panel\" INTERSECT SELECT DISTINCT LOCATION FROM paintings WHERE mediumOn  =  \"canvas\""
            ]
        },
        {
            "id":42,
            "paraphrase":[
                "What are the locations that have works painted before 1885 and after 1930?"
            ],
            "question":" Find the locations that have paintings created before 1885 and after 1930?",
            "sql":[
                "SELECT DISTINCT LOCATION FROM paintings WHERE YEAR  <  1885 INTERSECT SELECT DISTINCT LOCATION FROM paintings WHERE YEAR  >  1930"
            ]
        },
        {
            "id":43,
            "paraphrase":[
                "What is the average height and width of paintings that are oil medium in gallery 241?"
            ],
            "question":" What are the average height and width of paintings that are oil medium in the place of gallery 241?",
            "sql":[
                "SELECT avg(height_mm) ,  avg(width_mm) FROM paintings WHERE medium  =  \"oil\" AND LOCATION  =  \"Gallery 241\""
            ]
        },
        {
            "id":44,
            "paraphrase":[
                "What is the height and id of the tallest painting created before 1900?"
            ],
            "question":" What are the maximum height and id of paintings painted before 1900?",
            "sql":[
                "SELECT max(height_mm) ,  paintingID FROM paintings WHERE YEAR  <  1900"
            ]
        },
        {
            "id":45,
            "paraphrase":[
                "What are largest height and width dimensions for paintings in each year?"
            ],
            "question":" What are the maximum height and width of paintings for each year?",
            "sql":[
                "SELECT max(height_mm) ,  max(width_mm) ,  YEAR FROM paintings GROUP BY YEAR ORDER BY YEAR"
            ]
        },
        {
            "id":46,
            "paraphrase":[
                "Find the average height and width of paintings grouped by painters and ordered by name"
            ],
            "question":" What are the average height and width of paintings grouped by painters and ordered by name?",
            "sql":[
                "SELECT avg(height_mm) ,  avg(width_mm) ,  painterID FROM paintings GROUP BY painterID ORDER BY title"
            ]
        },
        {
            "id":47,
            "paraphrase":[
                "What are the first names of all artists who have at least two paintings, and how many works did each create?"
            ],
            "question":" Find the first names and number of works of all artists who have at least two paintings?",
            "sql":[
                "SELECT T1.fname ,  count(*) FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID GROUP BY T2.painterID HAVING count(*)  >=  2"
            ]
        },
        {
            "id":48,
            "paraphrase":[
                "When did each artist who created less than 4 paintings die?"
            ],
            "question":" Find the death year of all artists who have at most 3 paintings?",
            "sql":[
                "SELECT T1.deathYear FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID GROUP BY T2.painterID HAVING count(*)  <=  3"
            ]
        },
        {
            "id":49,
            "paraphrase":[
                "When did the artist who made the fewest sculptures die?"
            ],
            "question":" Find the death year of the artist who made the least number of sculptures?",
            "sql":[
                "SELECT T1.deathYear FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID GROUP BY T2.sculptorID ORDER BY count(*) LIMIT 1"
            ]
        },
        {
            "id":50,
            "paraphrase":[
                "Tell me the height and id number of the widest painting in gallery 240."
            ],
            "question":" What are the id and height of the painting with the longest width in gallery 240?",
            "sql":[
                "SELECT paintingID ,  height_mm FROM paintings WHERE LOCATION  =  'Gallery 240' ORDER BY width_mm DESC LIMIT 1"
            ]
        },
        {
            "id":51,
            "paraphrase":[
                "What is the id of every painting created before the oldest painting in gallery 240?"
            ],
            "question":" What are the ids of the paintings created before all of the paintings in gallery 240?",
            "sql":[
                "SELECT paintingID FROM paintings WHERE YEAR  <   (SELECT min(YEAR) FROM paintings WHERE LOCATION  =  'Gallery 240')"
            ]
        },
        {
            "id":52,
            "paraphrase":[
                "List the ids of all paintings that are taller than the longest painting created after 1900."
            ],
            "question":" What are the ids of the paintings whose height is longer than the height of all paintings created after 1900?",
            "sql":[
                "SELECT paintingID FROM paintings WHERE height_mm  >   (SELECT max(height_mm) FROM paintings WHERE YEAR  >  1900)"
            ]
        },
        {
            "id":53,
            "paraphrase":[
                "Which artists have the most paintings in oil?"
            ],
            "question":" Find the top 3 artists who have the biggest number of painting works whose medium is oil?",
            "sql":[
                "SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID WHERE T2.medium  =  \"oil\" GROUP BY T2.painterID ORDER BY count(*) DESC LIMIT 3"
            ]
        },
        {
            "id":54,
            "paraphrase":[
                "Order all of the oil paintings by date of creation and list their ids, locations, and titles."
            ],
            "question":" List the painting id, location and title of the medium oil paintings ordered by year.",
            "sql":[
                "SELECT paintingID ,  title ,  LOCATION FROM paintings WHERE medium  =  \"oil\" ORDER BY YEAR"
            ]
        },
        {
            "id":55,
            "paraphrase":[
                "List the year, location, and name of all paintings that are taller than 1000 in alphabetical order."
            ],
            "question":" List the year, location and title of paintings whose height is longer than 1000 ordered by title.",
            "sql":[
                "SELECT title ,  LOCATION ,  YEAR FROM paintings WHERE height_mm  >  1000 ORDER BY title"
            ]
        },
        {
            "id":56,
            "paraphrase":[
                "What are the first and last names of the artists who did not sculpt but could paint."
            ],
            "question":" Find the first and last name of artists who have painting but no sculpture work.",
            "sql":[
                "SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN paintings AS T2 ON T1.artistID  =  T2.painterID EXCEPT SELECT T1.lname ,  T1.fname FROM artists AS T1 JOIN sculptures AS T2 ON T1.artistID  =  T2.sculptorID"
            ]
        },
        {
            "id":57,
            "paraphrase":[
                "Where do you have paintings that were created before 1885 that are not on canvas?"
            ],
            "question":" Find the locations that have paintings before 1885 and no work with medium on canvas?",
            "sql":[
                "SELECT DISTINCT LOCATION FROM paintings WHERE YEAR  <  1885 AND mediumOn ! =  \"canvas\""
            ]
        }
    ],
    "label_id":"",
    "review_id":""
}