{
    "data":[
        {
            "id":1,
            "paraphrase":[
                "What are the names of movies that do not have any ratings?"
            ],
            "question":" Find the titles of movies that don’t have any rating.",
            "sql":[
                "SELECT title FROM movies WHERE rating IS NULL"
            ]
        },
        {
            "id":2,
            "paraphrase":[
                "What are names of movies that have a 'G' ratings?"
            ],
            "question":" Find the names of movies whose rating is ‘G’.",
            "sql":[
                "SELECT title FROM movies WHERE rating  =  'G'"
            ]
        },
        {
            "id":3,
            "paraphrase":[
                "What are the movie titles for ones that are played in the Odeon theater?"
            ],
            "question":" Find the title of the movie that is played in the Odeon theater.",
            "sql":[
                "SELECT T1.title FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie WHERE T2.name  =  'Odeon'"
            ]
        },
        {
            "id":4,
            "paraphrase":[
                "What are the names of the movies that are played in any theater and the name of the corresponding theater?"
            ],
            "question":" Find the names of movies that are played in any theater and the name of the corresponding theater.",
            "sql":[
                "SELECT T1.title ,  T2.name FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie"
            ]
        },
        {
            "id":5,
            "paraphrase":[
                "How many movies had a 'G' rating?"
            ],
            "question":" Find the number of movies whose rating is ‘G’.",
            "sql":[
                "SELECT count(*) FROM movies WHERE rating  =  'G'"
            ]
        },
        {
            "id":6,
            "paraphrase":[
                "How many movies are playing in theaters?"
            ],
            "question":" How many movies are playing across all theaters?",
            "sql":[
                "SELECT count(*) FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie"
            ]
        },
        {
            "id":7,
            "paraphrase":[
                "How many different movies are playing?"
            ],
            "question":" How many distinct movies are on in theaters?",
            "sql":[
                "SELECT count(DISTINCT T1.code) FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie"
            ]
        },
        {
            "id":8,
            "paraphrase":[
                "How many different movie theaters exist?"
            ],
            "question":" How many distinct movie theaters are there?",
            "sql":[
                "SELECT count(DISTINCT name) FROM movietheaters"
            ]
        },
        {
            "id":9,
            "paraphrase":[
                "What is the rating of the movie what has a name including a word like 'Citizen'?"
            ],
            "question":" Find the rating of the movie whose name includes the word ‘Citizen’.",
            "sql":[
                "SELECT rating FROM movies WHERE title LIKE '%Citizen%'"
            ]
        },
        {
            "id":10,
            "paraphrase":[
                "What are the names of the movie theaters that are playing 'G' or 'PG' rated movies?"
            ],
            "question":" Find the name of the cinemas that are playing movies with either rating ‘G’ or rating ‘PG’.",
            "sql":[
                "SELECT title FROM movies WHERE rating  =  'G' OR rating  =  'PG'"
            ]
        },
        {
            "id":11,
            "paraphrase":[
                "What are the titles of all the movies that played at the Odeon or Imperial theater?"
            ],
            "question":" Find the name of the movies that are played in either cinema Odeon or Imperial.",
            "sql":[
                "SELECT T1.title FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie WHERE T2.name  =  'Odeon' OR T2.name  =  'Imperial'"
            ]
        },
        {
            "id":12,
            "paraphrase":[
                "What movie is playing at both the Odeon and Imperial theater?"
            ],
            "question":" Find the name of the movie that is on in both Odeon and Imperial theaters.",
            "sql":[
                "SELECT T1.title FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie WHERE T2.name  =  'Odeon' INTERSECT SELECT T1.title FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie WHERE T2.name  =  'Imperial'"
            ]
        },
        {
            "id":13,
            "paraphrase":[
                "What are the names of every movie that is not playing at the Odeon theater?"
            ],
            "question":" Find the name of all movies that are not played in Odeon theater.",
            "sql":[
                "SELECT title FROM movies EXCEPT SELECT T1.title FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie WHERE T2.name  =  'Odeon'"
            ]
        },
        {
            "id":14,
            "paraphrase":[
                "\tWhat are the movie names in alphabetical order?"
            ],
            "question":" List in alphabetical order the titles of all movies.",
            "sql":[
                "SELECT title FROM movies ORDER BY title"
            ]
        },
        {
            "id":15,
            "paraphrase":[
                "What are the movie names sorted by rating?"
            ],
            "question":" Find the titles of all movies sorted by their ratings.",
            "sql":[
                "SELECT title FROM movies ORDER BY rating"
            ]
        },
        {
            "id":16,
            "paraphrase":[
                "What is the name of the theater playing the most movies?"
            ],
            "question":" Find the name of the theater that is playing the most number of movies.",
            "sql":[
                "SELECT name FROM movietheaters GROUP BY name ORDER BY count(*) DESC LIMIT 1"
            ]
        },
        {
            "id":17,
            "paraphrase":[
                "What is the name of the film playing at the most number of theaters?"
            ],
            "question":" Find the name of the movie that is played in the most number of theaters.",
            "sql":[
                "SELECT T1.title FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie GROUP BY T1.title ORDER BY count(*) DESC LIMIT 1"
            ]
        },
        {
            "id":18,
            "paraphrase":[
                "How many movies exist for each rating?"
            ],
            "question":" Find the number of movies in each rating.",
            "sql":[
                "SELECT count(*) ,  rating FROM movies GROUP BY rating"
            ]
        },
        {
            "id":19,
            "paraphrase":[
                "How many movies have a rating that is not null?",
                "How many movies are there for each non-NULL rating?"
            ],
            "question":" Find the number of movies whose rating is not null.",
            "sql":[
                "SELECT count(*) ,  rating FROM movies WHERE rating IS NOT NULL GROUP BY rating"
            ]
        },
        {
            "id":20,
            "paraphrase":[
                "What are the names of every theater with at least one movie playing?"
            ],
            "question":" Find the name of theaters that has at least one movie playing.",
            "sql":[
                "SELECT name FROM movietheaters GROUP BY name HAVING count(*)  >=  1"
            ]
        },
        {
            "id":21,
            "paraphrase":[
                "What are the names of all cinemas not showing any movies?"
            ],
            "question":" Select the name of all movie theaters that are not currently showing a movie.",
            "sql":[
                "SELECT DISTINCT name FROM MovieTheaters WHERE Movie IS NULL"
            ]
        },
        {
            "id":22,
            "paraphrase":[
                "What are the names of theaters playing 'G' rated movies?"
            ],
            "question":" Find the name of the movie theaters that are playing the movies whose rating is ‘G’.",
            "sql":[
                "SELECT T2.name FROM movies AS T1 JOIN movietheaters AS T2 ON T1.code  =  T2.movie WHERE T1.rating  =  'G'"
            ]
        },
        {
            "id":23,
            "paraphrase":[
                "What are all of the movie names?"
            ],
            "question":" Select the title of all movies.",
            "sql":[
                "SELECT title FROM movie"
            ]
        },
        {
            "id":24,
            "paraphrase":[
                "What are the different movie ratings?"
            ],
            "question":" Show all the distinct ratings in the database.",
            "sql":[
                "SELECT DISTINCT rating FROM movies"
            ]
        },
        {
            "id":25,
            "paraphrase":[
                "What is all the information about the unrated movies?"
            ],
            "question":" Show all information of all unrated movies.",
            "sql":[
                "SELECT * FROM movies WHERE rating IS NULL"
            ]
        },
        {
            "id":26,
            "paraphrase":[
                "What are the names of the movies not being shown in any theaters?"
            ],
            "question":" Show the titles of movies not currently being shown in any theaters.",
            "sql":[
                "SELECT Title FROM Movies WHERE Code NOT IN (SELECT Movie FROM MovieTheaters WHERE Movie IS NOT NULL)"
            ]
        }
    ],
    "label_id":"",
    "review_id":""
}